A <- 2
A # 2

B = 10
B # 10

C = D <- 5 # D에 5를 넣고 C에 D의 값을 넣음
C # 5
D # 5

G <- E = 10
# Error

sum(x <- 1)
x # 1
sum(y = 1)
y # Error


# 더하기 : +
# 빼기 : -
# 곱하기 : *
# 나누기 : /
# 몫 : %/%
# 나머지 : %%
# 제곱수 : ** or ^

5 %/% 5 # 1
5 %% 5 # 0

# 크다 : >
# 크거나 같다 : >=
# 작다 : <
# 작거나 같다 : <=
# 같다 : ==
# 같지 않다 : !=
# 아니다 : !

5 > 3
# TRUE

5 >= 6
#FALSE


# 그리고(and) : &
# 또는(or) : !

x <- 1:3
x # 1 2 3

y <- 3:1
y # 3 2 1

(x > 0) & (y > 1)
# TRUE TRUE FALSE
# -> 순서쌍임 : (1,3), (2,2), (3,1)
# 위의 순서쌍을 한 쌍씩 조건문에 넣어서 함

(x>0) | (y>1)
# TRUE TRUE TRUE


#--------------------------------------------------
a <- 3
if(a%%2 == 0){
  print("짝수입니다.")
}else{
  print("홀수입니다.")
}
#--------------------------------------------------
# 조건문으로 학점 분류하기
b <- 80
if(b >= 90){
  print("A학점입니다.")
}else if(b>=80){
  print("B학점입니다.")
}else {
  print("C학점입니다.")
}
#--------------------------------------------------
